bench/st41_50u/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                  https://gitlab.com/opensimproject/CfdOF                    |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{

    wall
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    inlet
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.01;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    inlet001
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.01;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
